In [1]:
import numpy as np
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [36]:
df = pd.DataFrame({'col1': [1, 2,3,4,5], 'col2': [3, 4,0,np.nan, np.nan], 'col3': ['3', 'a','0','np.nan', 'np.nan'], 'col4': [3, 4,0,np.nan, np.nan]})

In [37]:
df

   col1  col2    col3  col4
0     1   3.0       3   3.0
1     2   4.0       a   4.0
2     3   0.0       0   0.0
3     4   NaN  np.nan   NaN
4     5   NaN  np.nan   NaN

In [39]:
df.col2.fillna(df.col1, inplace=True)

In [40]:
df

   col1  col2
0     1   3.0
1     2   4.0
2     3   0.0
3     4   4.0
4     5   5.0

In [18]:
col = df.columns[:2]
col2 = df.columns[2:]

In [16]:
col + col2

Index(['col1col3', 'col2col4'], dtype='object')

In [25]:
df.drop(col.append(col2), axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [22]:
list([col, col2])

[Index(['col1', 'col2'], dtype='object'),
 Index(['col3', 'col4'], dtype='object')]

In [33]:
for n in range(50,401,50):
    print(n)

50
100
150
200
250
300
350
400

In [35]:
list(range(50,401,50))

[50, 100, 150, 200, 250, 300, 350, 400]

In [39]:
df

   col1  col2    col3  col4
0     1   3.0       3   3.0
1     2   4.0       a   4.0
2     3   0.0       0   0.0
3     4   NaN  np.nan   NaN
4     5   NaN  np.nan   NaN

In [38]:
pd.get_dummies(df)

   col1  col2  col4  col3_0  col3_3  col3_a  col3_np.nan
0     1   3.0   3.0       0       1       0            0
1     2   4.0   4.0       0       0       1            0
2     3   0.0   0.0       1       0       0            0
3     4   NaN   NaN       0       0       0            1
4     5   NaN   NaN       0       0       0            1

In [92]:
df1 = pd.DataFrame([[1,2,3,4], [6,7,8,9]], columns=['D', 'B', 'E', 'A'], index=[1,2])
df2 = pd.DataFrame([[10,20,30,40], [60,70,80,90], [600,700,800,900]], columns=['A', 'B', 'C', 'D'], index=[2,3,4])

In [93]:
df1

   D  B  E  A
1  1  2  3  4
2  6  7  8  9

In [94]:
df2

     A    B    C    D
2   10   20   30   40
3   60   70   80   90
4  600  700  800  900

In [95]:
a1, a2 = df1.align(df2, join='left', axis=1)

In [96]:
a1

   D  B  E  A
1  1  2  3  4
2  6  7  8  9

In [97]:
a2

     D    B   E    A
2   40   20 NaN   10
3   90   70 NaN   60
4  900  700 NaN  600

In [79]:
from collections import defaultdict

In [114]:
l = LabelEncoder()

In [80]:
d = defaultdict(LabelEncoder)

In [143]:
data = pd.DataFrame({'cat' : ["paris", "paris", "tokyo", "amsterdam"], 'cat2' : ["a", "b", "b", "c"]})

In [77]:
data

         cat cat2
0      paris    a
1      paris    b
2      tokyo    b
3  amsterdam    c

In [67]:
cat_features = ['cat', 'cat2']

In [81]:
fit = data.apply(lambda x : d[x.name].fit_transform(x))

In [82]:
fit

   cat  cat2
0    1     0
1    1     1
2    2     1
3    0     2

In [86]:
d['cat'].classes_

array(['amsterdam', 'paris', 'tokyo'], dtype=object)

In [87]:
d['cat2'].classes_

array(['a', 'b', 'c'], dtype=object)

In [90]:
fit.apply(lambda x : d[x.name].inverse_transform(x))

         cat cat2
0      paris    a
1      paris    b
2      tokyo    b
3  amsterdam    c

In [100]:
data.nunique()

cat     3
cat2    3
dtype: int64

In [124]:
encoder = LabelEncoder()
for feature in cat_features:
    data[feature + '_labels'] = encoder.fit_transform(data[feature])

In [125]:
data

         cat cat2  new  new2  catlabels  cat2labels  cat_labels  cat2_labels
0      paris    a    1     0          1           0           1            0
1      paris    b    1     1          1           1           1            1
2      tokyo    b    2     1          2           1           2            1
3  amsterdam    c    0     2          0           2           0            2

In [126]:
encoder.classes_

array(['a', 'b', 'c'], dtype=object)

In [130]:
import category_encoders as ce

In [135]:
data

         cat cat2
0      paris    a
1      paris    b
2      tokyo    b
3  amsterdam    c

In [160]:
countEncoder = ce.CountEncoder()

In [148]:
countEncoder.fit(data)

CountEncoder(cols=['cat', 'cat2'], combine_min_nan_groups=True)

In [173]:
data2 = countEncoder.transform(data)

In [174]:
data2 = data2.add([2,2])

TypeError: can only concatenate str (not "int") to str

In [175]:
data2

         cat cat2
0      paris    a
1      paris    b
2      tokyo    b
3  amsterdam    c

In [167]:
countEncoder2 = ce.CountEncoder(cols=['cat','cat2'])

In [168]:
countEncoder2.fit(data2)

c:\users\glukh\appdata\local\programs\python\python38\lib\site-packages\category_encoders\utils.py:21: FutureWarning: is_categorical is deprecated and will be removed in a future version.  Use is_categorical_dtype instead
  elif pd.api.types.is_categorical(cols):

CountEncoder(cols=['cat', 'cat2'], combine_min_nan_groups=True)

In [169]:
countEncoder2.transform(data2)

   cat  cat2
0    2     2
1    2     2
2    2     2
3    2     2

In [171]:
data2.cat.diff()

0    NaN
1    0.0
2   -1.0
3    0.0
Name: cat, dtype: float64

In [176]:
data2

         cat cat2
0      paris    a
1      paris    b
2      tokyo    b
3  amsterdam    c

In [2]:
num = pd.Series([1,2,4,5,7,3,2])

In [3]:
cat = pd.Series(['a', 'a','a','b','b','b','c'])

In [4]:
mb = pd.Series(['a1', '2a','3a','b4','b5','b2','c3'])

In [5]:
bb = pd.Series(['aaa', 'ddd','qqq','asd','dfg','xcv','sss'])

In [6]:
dff = pd.DataFrame()

In [7]:
dff['cat'] = cat
dff['num'] = num
dff['mb'] = mb
dff['bb'] = bb

In [216]:
dff

  cat  num  mb   bb
0   a    1  a1  aaa
1   a    2  2a  ddd
6   c    2  c3  sss
5   b    3  b2  xcv
2   a    4  3a  qqq
3   b    5  b4  asd
4   b    7  b5  dfg

In [193]:
def time_since_last_project(series):
    # Return the time in hours
    return series.diff()

In [195]:
dff = dff.sort_values('num')

In [196]:
dff

  cat  num
0   a    1
1   a    2
6   c    2
5   b    3
2   a    4
3   b    5
4   b    7

In [197]:
dff.groupby(cat).transform(time_since_last_project)

   num
0  NaN
1  1.0
6  NaN
5  NaN
2  2.0
3  2.0
4  2.0

In [237]:
dff

  cat  num  mb   bb
0   a    1  a1  aaa
1   a    2  2a  ddd
2   a    4  3a  qqq
3   b    5  b4  asd
4   b    7  b5  dfg
5   b    3  b2  xcv
6   c    2  c3  sss

In [242]:
cat_features = ['cat', 'mb', '']

In [248]:
cat_features = dff.columns

In [249]:
cat_features

Index(['cat', 'num', 'mb', 'bb'], dtype='object')

In [204]:
import itertools

In [256]:
interactions = pd.DataFrame(index=dff.index)

In [257]:
for a,b in itertools.combinations(cat_features, 2):
    new_col_name = '_'.join([a,b])
    new_values = dff[a].apply(str) + "_" + dff[b].apply(str)
    encoder = LabelEncoder()
    interactions[new_col_name] = encoder.fit_transform(new_values)

In [258]:
interactions

   cat_num  cat_mb  cat_bb  num_mb  num_bb  mb_bb
0        0       2       0       0       0      2
1        1       0       1       1       1      0
2        2       1       2       4       4      1
3        4       4       3       5       5      4
4        5       5       4       6       6      5
5        3       3       5       3       3      3
6        6       6       6       2       2      6

In [241]:
cat_features

Index(['cat', 'num', 'mb', 'bb'], dtype='object')

In [17]:
s = (dff.dtypes == 'object')
object_cols = list(s[s].index)

In [18]:
object_cols

['cat', 'mb', 'bb']

In [24]:
col_with_objects = dff.select_dtypes(include=['object']).columns

In [25]:
encoder = LabelEncoder()
dff_plus = dff.copy()

In [26]:
dff_plus

  cat  num  mb   bb
0   a    1  a1  aaa
1   a    2  2a  ddd
2   a    4  3a  qqq
3   b    5  b4  asd
4   b    7  b5  dfg
5   b    3  b2  xcv
6   c    2  c3  sss

In [27]:
for col in col_with_objects:
    dff_plus[col] = encoder.fit_transform(dff[col])

In [28]:
dff_plus

   cat  num  mb  bb
0    0    1   2   0
1    0    2   0   2
2    0    4   1   4
3    1    5   4   1
4    1    7   5   3
5    1    3   3   6
6    2    2   6   5

In [29]:
dff

  cat  num  mb   bb
0   a    1  a1  aaa
1   a    2  2a  ddd
2   a    4  3a  qqq
3   b    5  b4  asd
4   b    7  b5  dfg
5   b    3  b2  xcv
6   c    2  c3  sss

In [36]:
dff.num.expanding(2).sum() - dff.num

0     NaN
1     1.0
2     3.0
3     7.0
4    12.0
5    19.0
6    22.0
Name: num, dtype: float64